prerequisite-data/get-network-contacts.yml
config:
  target: "http://localhost:5000"
  version: 'v2'
  targetToken: "http://localhost:5000/api/v1/auth/login"
  # uploadFileUri: "http://localhost:5000/file/upload-file"
  # username: 'rattiya@ekoapp.com'
  # password: 'password'
  # payload:
  #   path: "images.csv"
  #   fields:
  #     - "key"
  #     - "filename"
  #     - "size"
  #     - "mimetype"
  auth:
    path: "./prerequisite-data/creator-users.csv"
    fields:
      - "username"
      - "password"
    order: "sequence"
  phases:
    - duration: 1
      arrivalCount: 1
  processor: "card-helpers.js"
scenarios:
  - engine: "eko"
    flow:
      # - function: "mockCardDueDate"
      # - function: "mockCardComponentDatas"
      - send:
          # rpc: "user.getContacts"
          rpc: "v1/user.getNetworkContacts"
          params:
            - 0
            - 20